app/controllers/boards_controller.rb

SELECT * FROM "boards"
---
  def index
    @boards = Board.all

SELECT * FROM "postits" WHERE ("postits".board_id = 12)
---
  def edit
    @hash = {
      "_rev" => @board.id,
      :title => @board.title,
      :background => @board.background,
      :elements => @board.postits.collect {|p| p.attributes }

SELECT * FROM "boards" WHERE ("boards"."id" = 9)
---
  def load_board
    @board = Board.find(params[:id])