app/controllers/simpletexts_controller.rb

  def index
    @simpletexts = Simpletext.all
---
SELECT * FROM "simpletexts"

  def create
    @simpletext = Simpletext.new(params[:simpletext])

    respond_to do |format|
      if @simpletext.save
---
INSERT INTO "simpletexts" ("autor_id", "created_at", "title", "updated_at", "content") VALUES(1, '2010-06-20 08:06:26', 'Sabão', '2010-06-20 08:06:26', 'sabao nao mata, sabao nao morde

  def update
    respond_to do |format|
      if @simpletext.update_attributes(params[:simpletext])
---
UPDATE "simpletexts" SET "updated_at" = '2010-06-20 08:10:24', "content" = 'Eu preciso comer um pão

  def destroy
    @simpletext.destroy
---
DELETE FROM "simpletexts" WHERE "id" = 1

  def load_simpletext
    @simpletext = Simpletext.find(params[:id])
---
SELECT * FROM "simpletexts" WHERE ("simpletexts"."id" = 3)