app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "activated_at", "crypted_password", "remember_token_expires_at", "updated_at", "activation_code", "remember_token", "login", "email") VALUES('', '39484ef524a87d5a8b84a173157250b40fcc2e5e', '2010-06-17 01:11:59', NULL, '7f2f43084527efcb1e6a44f734a57bfdf51603ae', NULL, '2010-06-17 01:11:59', 'e3a3d038c85d71a6b2e9739713655e1ec8b28c32', NULL, 'perenecabuto', 'perenecabuto@gmail.com')

  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?
---
SELECT * FROM "users" WHERE ("users"."activation_code" = '4de6ba9e92a6a4ceda9827d5571163ecea4bb80d') LIMIT 1